schreibfaul1/ESP32-MiniWebRadio/src/common.h
    void setLastConnectedFile(const char* lastconnectedfile){
        free(m_lastConnectedFile);
        m_lastConnectedFile = x_ps_strdup(lastconnectedfile);
        int pos = lastIndexOf(m_lastConnectedFile, '/');
        if(pos == -1){
            free(m_lastConnectedFileName);
            m_lastConnectedFileName = x_ps_strdup(m_lastConnectedFile);
            free(m_lastConnectedFolder);
            m_lastConnectedFolder = x_ps_strdup("");
        }
        else{
            free(m_lastConnectedFileName);
            m_lastConnectedFileName = x_ps_strdup(m_lastConnectedFile + pos);
            free(m_lastConnectedFolder);
            m_lastConnectedFolder = x_ps_strndup(m_lastConnectedFile, pos);
        }
        // log_e("lastConnectedFile %s", lastconnectedfile);
        // log_e("m_lastConnectedFileName %s", m_lastConnectedFileName);
        // log_e("m_lastConnectedFolder %s", m_lastConnectedFolder);
        listFilesInDir(m_lastConnectedFolder, true, false);
        sort();
    }
    const char* getLastConnectedFolder(){
        return m_lastConnectedFolder;
    }

    const char* getLastConnectedFileName(){
        return m_lastConnectedFileName;
    }
    int getPosByFileName(const char* fileName){
        for(int i = 0; i < m_files.size(); i++){
            if(!strcmp(m_files[i].fileName, fileName + 1)) return i; // fileName without '/'
        }
        return -1;
    }

private:
    void freeFilesVector() {
        for (auto& file : m_files) {
            if (file.fileName) {
                free(file.fileName);  // free PSRAM
                file.fileName = nullptr;
            }
            if(file.filePath) {
                free(file.filePath);  // free PSRAM
                file.filePath = nullptr;
            }
        }
        m_files.clear();
        m_files.shrink_to_fit();
    }

    void sort(){
        std::sort(m_files.begin(), m_files.end(), [](const FileInfo& a, const FileInfo& b) {
            // Zuerst nach Ordner vs. Datei sortieren
            if (a.fileSize == -1 && b.fileSize != -1) {
                return true;  // a ist Ordner, b ist Datei
            }
            if (a.fileSize != -1 && b.fileSize == -1) {
                return false;  // a ist Datei, b ist Ordner
            }
            // Wenn beide entweder Ordner oder beide Dateien sind, alphabetisch sortieren
            return strcmp(a.fileName, b.fileName) < 0;
        });
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class stationManagement{
private:
    struct sta{
        std::vector<uint8_t> fav;
        std::vector<uint16_t>favStaNr;
        std::vector<char*> country;
        std::vector<char*> name;
        std::vector<char*> url;
    } m_stations;

    uint16_t  m_staCnt = 0;
    uint16_t  m_staFavCnt = 0;
    uint16_t* m_curStation = 0;

public:
    stationManagement(uint16_t* curStation){
        clearStations();
        m_curStation = curStation;
    }
    ~stationManagement(){
        clearStations();
    }
private:
    void clearStations(){
        vector_clear_and_shrink(m_stations.country);
        vector_clear_and_shrink(m_stations.name);
        vector_clear_and_shrink(m_stations.url);
        m_stations.fav.clear();
        m_stations.fav.shrink_to_fit();
        m_stations.favStaNr.clear();
        m_stations.favStaNr.shrink_to_fit();

        m_stations.country.push_back(x_ps_strdup("unknown"));
        m_stations.name.push_back(x_ps_strdup("unknown"));
        m_stations.url.push_back(x_ps_strdup("unknown"));
        m_stations.fav.push_back('0');
        m_stations.favStaNr.push_back(0);
    }
public:
    void updateStationsList(){
        clearStations();
        uint8_t item = 0;
        m_staCnt = 0;
        m_staFavCnt = 0;
        if(!SD_MMC.exists("/stations.json")) {return;}
        char buff[1024];
        File file = SD_MMC.open("/stations.json");
        while (file.available()) {
            char c = file.read();
            if (c == '[' || c == ']' || c == ',' || c == '\n' || c == '\r') {continue;} // skip
            if(c == '\"') { // start of string
                int pos =file.readBytesUntil('\"', buff, 1024);
                buff[pos] = 0;

                if(item == 0){
                    m_stations.fav.push_back(buff[0]);
                    m_staCnt++;
                    if(buff[0] == '*'){
                        m_staFavCnt++;
                        m_stations.favStaNr.push_back(m_staCnt);
                    }
                }
                if(item == 1){
                    m_stations.country.push_back(x_ps_strdup(buff));
                }
                if(item == 2){
                    m_stations.name.push_back(x_ps_strdup(buff));
                }
                if(item == 3) {
                    m_stations.url.push_back(x_ps_strdup(buff));
                }
                item++;
                if(item > 3) item = 0;
                if(m_staCnt > 999) break;
            }
        }
        file.close();
    }
//----------------------------------------------------------------------------------------------------------
    uint16_t getSumStations(){
        return m_staCnt;
    }
//----------------------------------------------------------------------------------------------------------
    uint16_t getSumFavStations(){
        return m_staFavCnt;
    }

//----------------------------------------------------------------------------------------------------------
    uint16_t nextStation(){
        if(!m_staCnt) return 1;
        (*m_curStation)++;
        if(*m_curStation > m_staCnt) *m_curStation = 1;
        return *m_curStation;
    }
//----------------------------------------------------------------------------------------------------------
    uint16_t nextFavStation(){
        if(!m_staCnt) return 1;
        uint16_t cnt = 0;
        int16_t tmp = (*m_curStation);
        while(true){
            tmp++;
            cnt++;
            if(cnt > m_staCnt) break;
            if(tmp > m_staCnt) tmp = 1;
            if(m_stations.fav[tmp] == '*') { *m_curStation = tmp;   break;}
        }
        return *m_curStation;
    }
//----------------------------------------------------------------------------------------------------------
    uint16_t prevStation(){
        if(!m_staCnt) return 1;
        (*m_curStation)--;
        if(*m_curStation < 1) *m_curStation = m_staCnt;
        return *m_curStation;
    }
//----------------------------------------------------------------------------------------------------------
    uint16_t prevFavStation(){
        if(!m_staCnt) return 1;
        uint16_t cnt = 0;
        int16_t tmp = (*m_curStation);
        while(true){
            tmp--;
            cnt++;
            if(cnt > m_staCnt) break;
            if(tmp < 1) tmp = m_staCnt;
            if(m_stations.fav[tmp] == '*') { *m_curStation = tmp;   break;}
        }
        return *m_curStation;
    }
//----------------------------------------------------------------------------------------------------------
    uint16_t setStationByNumber(uint16_t staNr){
        if(!m_staCnt) return 1;
        if(staNr > m_staCnt) *m_curStation = m_staCnt;
        else *m_curStation = staNr;
        return *m_curStation;
    }
//----------------------------------------------------------------------------------------------------------
    const char* getStationName(uint16_t staNr){
        if(staNr > m_staCnt) return strdup("unknown");
        if(!m_stations.name[staNr]) return strdup("unknown");
        return m_stations.name[staNr];
    }
    char getStationFav(uint16_t staNr){  // 0 = not fav, * = fav, 1..3 = fav number (notused)
        if(staNr > m_staCnt) return '0';
        if(!m_stations.fav[staNr]) return '0';
        return m_stations.fav[staNr];
    }
    const char* getStationUrl(uint16_t staNr){
        if(staNr > m_staCnt) return strdup("unknown");
        if(!m_stations.url[staNr]) return strdup("unknown");
        return m_stations.url[staNr];
    }
    const char* getStatonCountry(uint16_t staNr){
        if(staNr > m_staCnt) return strdup("unknown");
        if(!m_stations.country[staNr]) return strdup("unknown");
        return m_stations.country[staNr];
    }
};

//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

/*  ╔═══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
    ║                                                     G R A P H I C   O B J E C T S                                                         ║
    ╚═══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

extern __attribute__((weak)) void graphicObjects_OnChange(const char* name, int32_t arg1);
extern __attribute__((weak)) void graphicObjects_OnClick(const char* name, uint8_t val);
extern __attribute__((weak)) void graphicObjects_OnRelease(const char* name, releasedArg ra);

